In [1]:
import pandas as pd

In [2]:
# Loading the data.
insurance_data_df = pd.read_csv('resources/insurance.csv')

age_income_df = pd.read_csv("resources/age_income_scraping.csv", index_col= False)

In [3]:
# Checking the data.
age_income_df.head()

   Age      25%      50%      75%         90%         99%    Average%
0   17     $972   $3,013   $7,500  $17,610.00  $79,000.00   $7,761.47
1   18   $1,600   $6,000  $14,820  $25,001.00  $65,002.00  $10,753.50
2   19   $3,990  $11,515  $23,000  $35,000.00  $71,001.00  $15,640.00
3   20   $6,000  $16,479  $27,516  $40,000.00  $80,004.00  $19,526.09
4   21  $10,000  $20,000  $30,001  $41,820.00  $83,002.00  $22,363.58

In [4]:
# Dropping unecessary columns.
average_income_df = age_income_df.drop(['25%', "50%", '75%', "90%", "99%"], axis=1)

average_income_df = average_income_df.rename(columns= {"Age":"age","Average%":"average_income"})

In [5]:
# Reset the index.
average_income_df = average_income_df.reset_index(drop=True)

In [6]:
# Checking the insurance data.
insurance_data_df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [7]:
# Checking the income dataframe.
average_income_df.head()

   age average_income
0   17      $7,761.47
1   18     $10,753.50
2   19     $15,640.00
3   20     $19,526.09
4   21     $22,363.58

In [8]:
# Merging the dataframes.
data_df = pd.merge(average_income_df, insurance_data_df, how="inner")

In [9]:
# Checking the complete dataframe.
data_df.head()

   age average_income     sex     bmi  children smoker     region     charges
0   18     $10,753.50    male  33.770         1     no  southeast  1725.55230
1   18     $10,753.50    male  34.100         0     no  southeast  1137.01100
2   18     $10,753.50  female  26.315         0     no  northeast  2198.18985
3   18     $10,753.50  female  38.665         2     no  northeast  3393.35635
4   18     $10,753.50  female  35.625         0     no  northeast  2211.13075

In [10]:
# Adding column 'id' to the dataframe.
data_df['id'] = range(len(data_df))

In [11]:
# Change the columns order.
data_df = data_df[['id', 'age', 'average_income', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges']]

In [12]:
# Checking the complete dataframe reordered.
print(data_df)

        id  age average_income     sex     bmi  children smoker     region  \
0        0   18     $10,753.50    male  33.770         1     no  southeast
1        1   18     $10,753.50    male  34.100         0     no  southeast
2        2   18     $10,753.50  female  26.315         0     no  northeast
3        3   18     $10,753.50  female  38.665         2     no  northeast
4        4   18     $10,753.50  female  35.625         0     no  northeast
...    ...  ...            ...     ...     ...       ...    ...        ...
1333  1333   64     $87,985.91  female  31.825         2     no  northeast
1334  1334   64     $87,985.91  female  26.885         0    yes  northwest
1335  1335   64     $87,985.91    male  26.410         0     no  northeast
1336  1336   64     $87,985.91    male  36.960         2    yes  southeast
1337  1337   64     $87,985.91    male  23.760         0    yes  southeast

          charges
0      1725.55230
1      1137.01100
2      2198.18985
3      3393.35635
4      2211.13075
...           ...
1333  16069.08475
1334  29330.98315
1335  14394.55790
1336  49577.66240
1337  26926.51440

[1338 rows x 9 columns]

In [13]:
# Checking the data types.
data_df.dtypes

id                  int64
age                 int64
average_income     object
sex                object
bmi               float64
children            int64
smoker             object
region             object
charges           float64
dtype: object

In [14]:
# Exporting to csv.
data_df.to_csv("resources/insurance_indexed.csv")